---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointTypeMismatch
source: html/46e9e0c0-ec65-d999-d008-59e396dae368.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointTypeMismatch Property

The element has a connector with a fitting joint type mismatch

## Syntax (C#)
```csharp
public static FailureDefinitionId JointTypeMismatch { get; }
```